{
    //簡単
    var easy_q = [
        {
            q_k : [1,"レ",2,3,4,5],
            q_a : [2,"レ",1,3,4,5],
            ex_1 : "レ点（レてん）: 文章の中に「レ」という記号が付いている部分。<br>下から上に読むことを指示します。"
        },
        {
            q_k : [1,2,"レ",3,4,5],
            q_a : [1,3,"レ",2,4,5],
            ex_1 : "レ点（レてん）: 文章の中に「レ」という記号が付いている部分。<br>下から上に読むことを指示します。" 
        },
        {
            q_k : [1,2,3,"レ",4,5],
            q_a : [1,2,4,"レ",3,5],
            ex_1 : "レ点（レてん）: 文章の中に「レ」という記号が付いている部分。<br>下から上に読むことを指示します。" 
        },
        {
            q_k : [1,2,3,4,"レ",5],
            q_a : [1,2,3,5,"レ",4],
            ex_1 : "レ点（レてん）: 文章の中に「レ」という記号が付いている部分。<br>下から上に読むことを指示します。" 
        },
        {
            q_k : [1,"二",2,"一",3,4,5],
            q_a : [2,"二",1,"一",3,4,5],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,"二",2,3,"一",4,5],
            q_a : [3,"二",1,2,"一",4,5],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,"二",2,3,4,"一",5],
            q_a : [4,"二",1,2,3,"一",5],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,"二",2,3,4,5,"一"],
            q_a : [5,"二",1,2,3,4,"一"],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,2,"二",3,"一",4,5],
            q_a : [1,3,"二",2,"一",4,5],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,2,"二",3,4,"一",5],
            q_a : [1,4,"二",2,3,"一",5],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,2,"二",3,4,"一",5],
            q_a : [1,4,"二",2,3,"一",5],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,2,"二",3,4,5,"一"],
            q_a : [1,5,"二",2,3,4,"一"],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,2,3,"二",4,"一",5],
            q_a : [1,2,4,"二",3,"一",5],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,2,3,"二",4,5,"一"],
            q_a : [1,2,5,"二",3,4,"一"],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,2,3,4,"二",5,"一"],
            q_a : [1,2,3,5,"二",4,"一"],
            ex_2 : "一二点（いちにてん）: 一点と二点が付いている部分。<br>順番を変えて、特定の順序で読むことを指示します。"
        },
        {
            q_k : [1,"下",2,"上",3,4,5],
            q_a : [2,"下",1,"上",3,4,5],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        },
        {
            q_k : [1,"下",2,3,"上",4,5],
            q_a : [3,"下",1,2,"上",4,5],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        },
        {
            q_k : [1,"下",2,3,4,"上",5],
            q_a : [4,"下",1,2,3,"上",5],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        },
        {
            q_k : [1,"下",2,3,4,5,"上"],
            q_a : [5,"下",1,2,3,4,"上"],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        },
        {
            q_k : [1,2,"下",3,"上",4,5],
            q_a : [1,3,"下",2,"上",4,5],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        },
        {
            q_k : [1,2,"下",3,4,"上",5],
            q_a : [1,4,"下",2,3,"上",5],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        },
        {
            q_k : [1,2,"下",3,4,"上",5],
            q_a : [1,4,"下",2,3,"上",5],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        },
        {
            q_k : [1,2,"下",3,4,5,"上"],
            q_a : [1,5,"下",2,3,4,"上"],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        },
        {
            q_k : [1,2,3,"下",4,"上",5],
            q_a : [1,2,4,"下",3,"上",5],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        },
        {
            q_k : [1,2,3,"下",4,5,"上"],
            q_a : [1,2,5,"下",3,4,"上"],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        },
        {
            q_k : [1,2,3,4,"下",5,"上"],
            q_a : [1,2,3,5,"下",4,"上"],
            ex_3 : "上下点（じょうげてん）: 上下の点が付いている部分。<br>上の部分を読んだ後に下の部分を読むことを指示します。"
        }
    ]
    //普通
    var normal_q = [
        {
            q_k : [1,"二",2,"一","レ",3,4,5,6,7,8],
            q_a : [3,"二",2,"一","レ",1,4,5,6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,"一",3,"レ",4,5,6,7,8],
            q_a : [2,"二",1,"一",4,"レ",3,5,6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,"一",3,4,"レ",5,6,7,8],
            q_a : [2,"二",1,"一",3,5,"レ",4,6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,"一",3,4,5,"レ",6,7,8],
            q_a : [2,"二",1,"一",3,4,6,"レ",5,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,"一",3,4,5,6,"レ",7,8],
            q_a : [2,"二",1,"一",3,4,5,7,"レ",6,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,"一",3,4,5,6,7,"レ",8],
            q_a : [2,"二",1,"一",3,4,5,6,8,"レ",7],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,"レ",3,4,"一",5,6,7,8],
            q_a : [4,"二",2,"レ",1,3,"一",5,6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,"レ",3,4,5,"一",6,7,8],
            q_a : [5,"二",2,"レ",1,3,4,"一",6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,"レ",3,4,5,6,"一",7,8],
            q_a : [6,"二",2,"レ",1,3,4,5,"一",7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,"レ",3,4,5,6,7,"一",8],
            q_a : [7,"二",2,"レ",1,3,4,5,6,"一",8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,"レ",3,4,5,6,7,8,"一"],
            q_a : [8,"二",2,"レ",1,3,4,5,6,7,"一"],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,3,"レ",4,5,"一",6,7,8],
            q_a : [5,"二",1,3,"レ",2,4,"一",6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,3,4,"レ",5,6,"一",7,8],
            q_a : [6,"二",1,2,4,"レ",3,5,"一",7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,3,4,5,"レ",6,7,"一",8],
            q_a : [7,"二",1,2,3,5,"レ",4,6,"一",8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"二",2,3,4,5,6,"レ",7,8,"一"],
            q_a : [8,"二",1,2,3,4,6,"レ",5,7,"一"],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,2,"二",3,"レ",4,5,"一",6,7,8],
            q_a : [1,5,"二",3,"レ",2,4,"一",6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,2,3,"二",4,"レ",5,6,"一",7,8],
            q_a : [1,2,6,"二",4,"レ",3,5,"一",7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,2,3,4,"二",5,"レ",6,7,"一",8],
            q_a : [1,2,3,7,"二",5,"レ",4,6,"一",8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,2,3,4,5,"二",6,"レ",7,8,"一"],
            q_a : [1,2,3,4,8,"二",6,"レ",5,7,"一"],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。"
        },
        {
            q_k : [1,"下",2,"上","レ",3,4,5,6,7,8],
            q_a : [3,"下",2,"上","レ",1,4,5,6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"上",3,"レ",4,5,6,7,8],
            q_a : [2,"下",1,"上",4,"レ",3,5,6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"上",3,4,"レ",5,6,7,8],
            q_a : [2,"下",1,"上",3,5,"レ",4,6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"上",3,4,5,"レ",6,7,8],
            q_a : [2,"下",1,"上",3,4,6,"レ",5,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"上",3,4,5,6,"レ",7,8],
            q_a : [2,"下",1,"上",3,4,5,7,"レ",6,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"上",3,4,5,6,7,"レ",8],
            q_a : [2,"下",1,"上",3,4,5,6,8,"レ",7],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"レ",3,4,"上",5,6,7,8],
            q_a : [4,"下",2,"レ",1,3,"上",5,6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"レ",3,4,5,"上",6,7,8],
            q_a : [5,"下",2,"レ",1,3,4,"上",6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"レ",3,4,5,6,"上",7,8],
            q_a : [6,"下",2,"レ",1,3,4,5,"上",7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"レ",3,4,5,6,7,"上",8],
            q_a : [7,"下",2,"レ",1,3,4,5,6,"上",8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"レ",3,4,5,6,7,8,"上"],
            q_a : [8,"下",2,"レ",1,3,4,5,6,7,"上"],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,3,"レ",4,5,"上",6,7,8],
            q_a : [5,"下",1,3,"レ",2,4,"上",6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,3,4,"レ",5,6,"上",7,8],
            q_a : [6,"下",1,2,4,"レ",3,5,"上",7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,3,4,5,"レ",6,7,"上",8],
            q_a : [7,"下",1,2,3,5,"レ",4,6,"上",8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,3,4,5,6,"レ",7,8,"上"],
            q_a : [8,"下",1,2,3,4,6,"レ",5,7,"上"],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,2,"下",3,"レ",4,5,"上",6,7,8],
            q_a : [1,5,"下",3,"レ",2,4,"上",6,7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,2,3,"下",4,"レ",5,6,"上",7,8],
            q_a : [1,2,6,"下",4,"レ",3,5,"上",7,8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,2,3,4,"下",5,"レ",6,7,"上",8],
            q_a : [1,2,3,7,"下",5,"レ",4,6,"上",8],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,2,3,4,5,"下",6,"レ",7,8,"上"],
            q_a : [1,2,3,4,8,"下",6,"レ",5,7,"上"],
            ex_1 : "レ点: 下を読んでから読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,"一",4,5,6,7,8,"上"],
            q_a : [8,"下",2,"二",1,"一",3,4,5,6,7,"上"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,4,"一",5,6,7,8,"上"],
            q_a : [8,"下",3,"二",1,2,"一",4,5,6,7,"上"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,4,5,"一",6,7,8,"上"],
            q_a : [8,"下",4,"二",1,2,3,"一",5,6,7,"上"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,4,5,6,"一",7,8,"上"],
            q_a : [8,"下",5,"二",1,2,3,4,"一",6,7,"上"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,4,5,6,7,"一",8,"上"],
            q_a : [8,"下",6,"二",1,2,3,4,5,"一",7,"上"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,4,5,6,7,"上",8,"一"],
            q_a : [6,"下",8,"二",1,2,3,4,5,"上",7,"一"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,4,5,6,"上",7,8,"一"],
            q_a : [5,"下",8,"二",1,2,3,4,"上",6,7,"一"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,4,5,"上",6,7,8,"一"],
            q_a : [4,"下",8,"二",1,2,3,"上",5,6,7,"一"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,4,"上",5,6,7,8,"一"],
            q_a : [3,"下",8,"二",1,2,"上",4,5,6,7,"一"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,"上",4,5,6,7,8,"一"],
            q_a : [2,"下",8,"二",1,"上",3,4,5,6,7,"一"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,"上",4,5,6,7,"一",8],
            q_a : [2,"下",7,"二",1,"上",3,4,5,6,"一",8],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,"上",4,5,6,"一",7,8],
            q_a : [2,"下",6,"二",1,"上",3,4,5,"一",7,8],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,"上",4,5,"一",6,7,8],
            q_a : [2,"下",5,"二",1,"上",3,4,"一",6,7,8],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"二",3,"上",4,"一",5,6,7,8],
            q_a : [2,"下",4,"二",1,"上",3,"一",5,6,7,8],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"上",3,"二",4,"一",5,6,7,8],
            q_a : [2,"下",1,"上",4,"二",3,"一",5,6,7,8],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"上",3,4,"二",5,"一",6,7,8],
            q_a : [2,"下",1,"上",3,5,"二",4,"一",6,7,8],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"上",3,4,5,"二",6,"一",7,8],
            q_a : [2,"下",1,"上",3,4,6,"二",5,"一",7,8],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"上",3,4,5,6,"二",7,"一",8],
            q_a : [2,"下",1,"上",3,4,5,7,"二",6,"一",8],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        },
        {
            q_k : [1,"下",2,"上",3,4,5,6,7,"二",8,"一"],
            q_a : [2,"下",1,"上",3,4,5,6,8,"二",7,"一"],
            ex_2 : "一二点: 一を読んだ後、ジャンプして二（または三、四）を読む。",
            ex_3 : "上下点: 上を読んだ後、ジャンプして下（または中）を読む。"
        }
    ]
    //難問
    var hard_q = [
        {
            q_k : [1,"下",2,"二",3,4,"レ",5,6,7,8,9,"一",10,"上"],
            q_a : [10,"下",8,"二",1,3,"レ",2,4,5,6,7,"一",9,"上"]
        },
        {
            q_k : [1,"下",2,"二",3,4,5,"レ",6,7,8,9,"一",10,"上"],
            q_a : [10,"下",8,"二",1,2,4,"レ",3,5,6,7,"一",9,"上"]
        },
        {
            q_k : [1,"下",2,"二",3,4,5,6,"レ",7,8,9,"一",10,"上"],
            q_a : [10,"下",8,"二",1,2,3,5,"レ",4,6,7,"一",9,"上"]
        },
        {
            q_k : [1,"下",2,"二",3,"上",4,5,6,7,8,9,"一","レ",10],
            q_a : [2,"下",10,"二",1,"上",3,4,5,6,7,9,"一","レ",8]
        },
        {
            q_k : [1,"下",2,"二",3,"上",4,5,6,7,8,9,"一","レ",10],
            q_a : [2,"下",10,"二",1,"上",3,4,5,6,7,9,"一","レ",8]
        },
        {
            q_k : [1,"下",2,"上",3,"二",4,5,6,7,8,9,"一","レ",10],
            q_a : [2,"下",1,"上",10,"二",3,4,5,6,7,9,"一","レ",8]
        },
        {
            q_k : [1,"下",2,"上",3,4,"二",5,6,7,8,9,"一","レ",10],
            q_a : [2,"下",1,"上",3,10,"二",4,5,6,7,9,"一","レ",8]
        },
        {
            q_k : [1,"下",2,"上",3,4,5,"二",6,7,8,9,"一","レ",10],
            q_a : [2,"下",1,"上",3,4,10,"二",5,6,7,9,"一","レ",8]
        },
        {
            q_k : [1,"下",2,"上",3,4,5,6,"二",7,8,9,"一","レ",10],
            q_a : [2,"下",1,"上",3,4,5,10,"二",6,7,9,"一","レ",8]
        },
        {
            q_k : [1,"下",2,"上",3,4,5,6,7,"二",8,9,"一","レ",10],
            q_a : [2,"下",1,"上",3,4,5,6,10,"二",7,9,"一","レ",8]
        },
        {
            q_k : [1,"下",2,"上",3,4,5,6,7,8,"二",9,"一","レ",10],
            q_a : [2,"下",1,"上",3,4,5,6,7,10,"二",9,"一","レ",8]
        },
        {
            q_k : [1,"二",2,"下",3,4,"レ",5,6,7,8,9,"上",10,"一"],
            q_a : [10,"二",8,"下",1,3,"レ",2,4,5,6,7,"上",9,"一"]
        },
        {
            q_k : [1,"二",2,"下",3,4,5,"レ",6,7,8,9,"一",10,"上"],
            q_a : [10,"二",8,"二",1,2,4,"レ",3,5,6,7,"一",9,"上"]
        },
        {
            q_k : [1,"二",2,"下",3,4,5,6,"レ",7,8,9,"上",10,"一"],
            q_a : [10,"二",8,"下",1,2,3,5,"レ",4,6,7,"上",9,"一"]
        },
        {
            q_k : [1,"二",2,"下",3,"一",4,5,6,7,8,9,"上","レ",10],
            q_a : [2,"二",10,"下",1,"一",3,4,5,6,7,9,"上","レ",8]
        },
        {
            q_k : [1,"二",2,"下",3,"一",4,5,6,7,8,9,"上","レ",10],
            q_a : [2,"二",10,"下",1,"一",3,4,5,6,7,9,"上","レ",8]
        },
        {
            q_k : [1,"二",2,"一",3,"下",4,5,6,7,8,9,"上","レ",10],
            q_a : [2,"二",1,"一",10,"下",3,4,5,6,7,9,"上","レ",8]
        },
        {
            q_k : [1,"二",2,"一",3,4,"下",5,6,7,8,9,"上","レ",10],
            q_a : [2,"二",1,"一",3,10,"下",4,5,6,7,9,"上","レ",8]
        },
        {
            q_k : [1,"二",2,"一",3,4,5,"下",6,7,8,9,"上","レ",10],
            q_a : [2,"二",1,"一",3,4,10,"下",5,6,7,9,"上","レ",8]
        },
        {
            q_k : [1,"二",2,"一",3,4,5,6,"下",7,8,9,"上","レ",10],
            q_a : [2,"二",1,"一",3,4,5,10,"下",6,7,9,"上","レ",8]
        },
        {
            q_k : [1,"二",2,"上",3,4,5,6,7,"下",8,9,"一","レ",10],
            q_a : [2,"二",1,"上",3,4,5,6,10,"下",7,9,"一","レ",8]
        },
        {
            q_k : [1,"二",2,"一",3,4,5,6,7,8,"下",9,"上","レ",10],
            q_a : [2,"二",1,"一",3,4,5,6,7,10,"下",9,"上","レ",8]
        },
        {
            q_k : [1,"下",2,"二",3,4,"レ",5,6,7,8,"一",9,10,"上"],
            q_a : [10,"下",7,"二",1,3,"レ",2,4,5,6,"一",8,9,"上"]
        },
        {
            q_k : [1,"下",2,"二",3,4,"レ",5,6,7,"一",8,9,10,"上"],
            q_a : [10,"下",6,"二",1,3,"レ",2,4,5,"一",7,8,9,"上"]
        },
        {
            q_k : [1,"下",2,"二",3,4,"レ",5,6,"一",7,8,9,10,"上"],
            q_a : [10,"下",5,"二",1,3,"レ",2,4,"一",6,7,8,9,"上"]
        },
        {
            q_k : [1,"下",2,"二",3,4,"レ",5,"一",6,7,8,9,10,"上"],
            q_a : [10,"下",4,"二",1,3,"レ",2,"一",5,6,7,8,9,"上"]
        },
        {
            q_k : [1,"下",2,"二",3,"一",4,"レ",5,6,7,8,9,10,"上"],
            q_a : [10,"下",2,"二",1,"一",4,"レ",3,5,6,7,8,9,"上"]
        },
        {
            q_k : [1,"下",2,"二",3,4,"レ",5,6,7,8,"上",9,10,"一"],
            q_a : [10,"下",7,"二",1,3,"レ",2,4,5,6,"上",8,9,"一"]
        },
        {
            q_k : [1,"下",2,"二",3,4,"レ",5,6,7,"上",8,9,10,"一"],
            q_a : [10,"下",6,"二",1,3,"レ",2,4,5,"上",7,8,9,"一"]
        },
        {
            q_k : [1,"下",2,"二",3,4,"レ",5,6,"上",7,8,9,10,"一"],
            q_a : [10,"下",5,"二",1,3,"レ",2,4,"上",6,7,8,9,"一"]
        },
        {
            q_k : [1,"下",2,"二",3,4,"レ",5,"上",6,7,8,9,10,"一"],
            q_a : [10,"下",4,"二",1,3,"レ",2,"上",5,6,7,8,9,"一"]
        },
        {
            q_k : [1,"下",2,"二",3,"上",4,"レ",5,6,7,8,9,10,"一"],
            q_a : [10,"下",2,"二",1,"上",4,"レ",3,5,6,7,8,9,"一"]
        }
    ]

    //ex_1,ex_2,ex_3は説明文です。
}

